In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 = {
    "name": ['Ashish', 'Harry', 'Rohan', 'Subh'],
    "Salary": [92, 34, 24, 17],
    "City": ['Rampur', 'Kolkata', 'Jaipur', 'Patna']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  Salary     City
0  Ashish      92   Rampur
1   Harry      34  Kolkata
2   Rohan      24   Jaipur
3    Subh      17    Patna

In [5]:
df.to_csv('data_folder/friends.csv')

In [6]:
# csv file without index
df.to_csv('data_folder/friends_without_index.csv', index=False)

In [7]:
# to show rows from first
df.head(2)

     name  Salary     City
0  Ashish      92   Rampur
1   Harry      34  Kolkata

In [8]:
# to show rows from last
df.tail(2)

    name  Salary    City
2  Rohan      24  Jaipur
3   Subh      17   Patna

In [9]:
# to see the max, min, count etc of the numerical columns
df.describe()

         Salary
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
data_frame = pd.read_csv('data_folder/ashish.csv')

In [11]:
data_frame

   Train  Speed     City
0    123     12   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [12]:
data_frame['Speed']

0    12
1    23
2    34
3    45
Name: Speed, dtype: int64

In [13]:
data_frame['Speed'][0]

12

In [14]:
data_frame['Speed'][0] = 50

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [15]:
data_frame

   Train  Speed     City
0    123     50   Rampur
1    456     23  Kolkata
2    789     34   Jaipur
3     12     45    Patna

In [16]:
data_frame.to_csv('data_folder/updated_ashish.csv', index=False)

In [17]:
# code to change the index instead of builtin 0,1,2,3
data_frame.index = ['first', 'second', 'third', 'fourth']

In [18]:
data_frame

        Train  Speed     City
first     123     50   Rampur
second    456     23  Kolkata
third     789     34   Jaipur
fourth     12     45    Patna

In [19]:
ser = pd.Series(np.random.rand(34))

In [20]:
ser

0     0.053205
1     0.075013
2     0.554791
3     0.902582
4     0.835246
5     0.355686
6     0.060837
7     0.397634
8     0.246574
9     0.799072
10    0.202043
11    0.001605
12    0.459311
13    0.071599
14    0.117462
15    0.999258
16    0.581561
17    0.723825
18    0.692774
19    0.496319
20    0.540484
21    0.322723
22    0.071247
23    0.415029
24    0.040014
25    0.203450
26    0.355776
27    0.588619
28    0.643808
29    0.766305
30    0.121870
31    0.431657
32    0.802316
33    0.223195
dtype: float64

In [21]:
type(ser)

pandas.core.series.Series

In [22]:
new_df = pd.DataFrame(np.random.rand(334, 5), index=np.arange(334))

In [23]:
new_df

            0         1         2         3         4
0    0.113748  0.090743  0.849483  0.732505  0.716665
1    0.978640  0.326711  0.708008  0.492678  0.090354
2    0.111575  0.573355  0.605075  0.016770  0.163355
3    0.482222  0.582363  0.648757  0.588044  0.436126
4    0.972434  0.555393  0.074069  0.479434  0.083058
..        ...       ...       ...       ...       ...
329  0.083463  0.722638  0.083766  0.475829  0.042728
330  0.746198  0.605953  0.415325  0.034253  0.236854
331  0.840454  0.892945  0.110913  0.604027  0.659915
332  0.262958  0.041827  0.723585  0.043194  0.388546
333  0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [24]:
new_df.head(10)

          0         1         2         3         4
0  0.113748  0.090743  0.849483  0.732505  0.716665
1  0.978640  0.326711  0.708008  0.492678  0.090354
2  0.111575  0.573355  0.605075  0.016770  0.163355
3  0.482222  0.582363  0.648757  0.588044  0.436126
4  0.972434  0.555393  0.074069  0.479434  0.083058
5  0.399059  0.965824  0.947327  0.275640  0.560488
6  0.001600  0.343217  0.893049  0.090097  0.686310
7  0.129345  0.687957  0.045786  0.207276  0.081083
8  0.853476  0.935406  0.906393  0.725621  0.399111
9  0.037854  0.360142  0.995574  0.077849  0.856702

In [25]:
type(new_df)

pandas.core.frame.DataFrame

In [26]:
new_df.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.509966    0.499187    0.475839    0.496454    0.499511
std      0.289035    0.296129    0.281014    0.285097    0.292328
min      0.001600    0.002494    0.007132    0.010518    0.006135
25%      0.266423    0.228677    0.226508    0.258948    0.260444
50%      0.525221    0.505674    0.472306    0.515331    0.475217
75%      0.756712    0.760834    0.712266    0.731320    0.771831
max      0.999026    0.997659    0.997655    0.992545    0.998348

In [27]:
new_df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [28]:
new_df.head()

          0         1         2         3         4
0  0.113748  0.090743  0.849483  0.732505  0.716665
1  0.978640  0.326711  0.708008  0.492678  0.090354
2  0.111575  0.573355  0.605075  0.016770  0.163355
3  0.482222  0.582363  0.648757  0.588044  0.436126
4  0.972434  0.555393  0.074069  0.479434  0.083058

In [29]:
new_df[0][0] = "Ashish"

In [30]:
new_df.head()

          0         1         2         3         4
0    Ashish  0.090743  0.849483  0.732505  0.716665
1   0.97864  0.326711  0.708008  0.492678  0.090354
2  0.111575  0.573355  0.605075  0.016770  0.163355
3  0.482222  0.582363  0.648757  0.588044  0.436126
4  0.972434  0.555393  0.074069  0.479434  0.083058

In [31]:
new_df.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [32]:
# Check the index.
new_df.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [33]:
# check the columns
new_df.columns

RangeIndex(start=0, stop=5, step=1)

In [34]:
# code to convert a data frame into numpy array.
new_df.to_numpy()

array([['Ashish', 0.09074301722442812, 0.8494831794363,
        0.7325045623185316, 0.7166654864961112],
       [0.9786398598711357, 0.3267105129365877, 0.7080083007903852,
        0.4926777257377487, 0.0903539834892082],
       [0.11157512818186377, 0.5733546515791023, 0.6050752805412449,
        0.016769958404698748, 0.16335498358379286],
       ...,
       [0.8404538694737703, 0.8929452103647298, 0.11091345968866029,
        0.6040274687788345, 0.6599154029309033],
       [0.26295797514582364, 0.0418271331983362, 0.7235846549852931,
        0.043194312626509856, 0.38854560837769714],
       [0.21143515713216432, 0.17886955829009676, 0.5354773161013912,
        0.6013068743434611, 0.023920949693261973]], dtype=object)

In [35]:
new_df[0][0] = 2.3

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [36]:
new_df.to_numpy

<bound method DataFrame.to_numpy of              0         1         2         3         4
0          2.3  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]>

In [37]:
# code to transpose a dataframe
new_df.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,2.3,0.97864,0.111575,0.482222,0.972434,0.399059,0.00160018,0.129345,0.853476,0.0378539,...,0.957647,0.409547,0.294448,0.485618,0.0888768,0.0834631,0.746198,0.840454,0.262958,0.211435
1,0.090743,0.326711,0.573355,0.582363,0.555393,0.965824,0.343217,0.687957,0.935406,0.360142,...,0.858503,0.0903247,0.307124,0.84545,0.72715,0.722638,0.605953,0.892945,0.0418271,0.17887
2,0.849483,0.708008,0.605075,0.648757,0.0740692,0.947327,0.893049,0.0457864,0.906393,0.995574,...,0.347909,0.298358,0.769825,0.477334,0.193268,0.0837659,0.415325,0.110913,0.723585,0.535477
3,0.732505,0.492678,0.01677,0.588044,0.479434,0.27564,0.0900968,0.207276,0.725621,0.0778485,...,0.633271,0.886462,0.424119,0.813813,0.720714,0.475829,0.0342528,0.604027,0.0431943,0.601307
4,0.716665,0.090354,0.163355,0.436126,0.0830578,0.560488,0.68631,0.0810828,0.399111,0.856702,...,0.154589,0.969738,0.355792,0.811017,0.612661,0.0427282,0.236854,0.659915,0.388546,0.0239209

In [38]:
new_df.head()

          0         1         2         3         4
0       2.3  0.090743  0.849483  0.732505  0.716665
1   0.97864  0.326711  0.708008  0.492678  0.090354
2  0.111575  0.573355  0.605075  0.016770  0.163355
3  0.482222  0.582363  0.648757  0.588044  0.436126
4  0.972434  0.555393  0.074069  0.479434  0.083058

In [39]:
#code to sort my data frame according to index descending order
new_df.sort_index(axis=0, ascending=False)

             0         1         2         3         4
333   0.211435  0.178870  0.535477  0.601307  0.023921
332   0.262958  0.041827  0.723585  0.043194  0.388546
331   0.840454  0.892945  0.110913  0.604027  0.659915
330   0.746198  0.605953  0.415325  0.034253  0.236854
329  0.0834631  0.722638  0.083766  0.475829  0.042728
..         ...       ...       ...       ...       ...
4     0.972434  0.555393  0.074069  0.479434  0.083058
3     0.482222  0.582363  0.648757  0.588044  0.436126
2     0.111575  0.573355  0.605075  0.016770  0.163355
1      0.97864  0.326711  0.708008  0.492678  0.090354
0          2.3  0.090743  0.849483  0.732505  0.716665

[334 rows x 5 columns]

In [40]:
# code to sort the dataframe as per the column.
new_df.sort_index(axis=1, ascending=False)

            4         3         2         1          0
0    0.716665  0.732505  0.849483  0.090743        2.3
1    0.090354  0.492678  0.708008  0.326711    0.97864
2    0.163355  0.016770  0.605075  0.573355   0.111575
3    0.436126  0.588044  0.648757  0.582363   0.482222
4    0.083058  0.479434  0.074069  0.555393   0.972434
..        ...       ...       ...       ...        ...
329  0.042728  0.475829  0.083766  0.722638  0.0834631
330  0.236854  0.034253  0.415325  0.605953   0.746198
331  0.659915  0.604027  0.110913  0.892945   0.840454
332  0.388546  0.043194  0.723585  0.041827   0.262958
333  0.023921  0.601307  0.535477  0.178870   0.211435

[334 rows x 5 columns]

In [41]:
newdf2 = new_df

In [42]:
newdf2[0][0] = 678

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [43]:
new_df

             0         1         2         3         4
0          678  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [44]:
newdf2

             0         1         2         3         4
0          678  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [45]:
newdf3 = newdf2.copy()

In [46]:
newdf3[0][0] = 'ash'

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [47]:
newdf2

             0         1         2         3         4
0          678  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [48]:
newdf3

             0         1         2         3         4
0          ash  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [49]:
newdf4 = newdf3[:]

In [50]:
newdf4[0][0] = 0.3456

/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
/home/user/Desktop/workspace/python-django-learning/Ecobiased/pandas_tutorial/venv/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3343: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

In [51]:
newdf3

             0         1         2         3         4
0       0.3456  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [52]:
new_df

             0         1         2         3         4
0          678  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [53]:
new_df.loc[0,0] = 890

In [82]:
new_df

             A         B         c         D         E
0         0.34  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [83]:
# code to change the column name
new_df.columns = list('abcde')

In [84]:
new_df

             a         b         c         d         e
0         0.34  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [85]:
new_df.columns = ['A', 'B', 'c', 'D', 'E']

In [86]:
new_df

             A         B         c         D         E
0         0.34  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [87]:
new_df.loc[0, 'A'] = 'Ashish Kumar'

In [88]:
new_df

                A         B         c         D         E
0    Ashish Kumar  0.090743  0.849483  0.732505  0.716665
1         0.97864  0.326711  0.708008  0.492678  0.090354
2        0.111575  0.573355  0.605075  0.016770  0.163355
3        0.482222  0.582363  0.648757  0.588044  0.436126
4        0.972434  0.555393  0.074069  0.479434  0.083058
..            ...       ...       ...       ...       ...
329     0.0834631  0.722638  0.083766  0.475829  0.042728
330      0.746198  0.605953  0.415325  0.034253  0.236854
331      0.840454  0.892945  0.110913  0.604027  0.659915
332      0.262958  0.041827  0.723585  0.043194  0.388546
333      0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [89]:
new_df.loc[0, 0] = 567

In [90]:
new_df

                A         B         c         D         E      0
0    Ashish Kumar  0.090743  0.849483  0.732505  0.716665  567.0
1         0.97864  0.326711  0.708008  0.492678  0.090354    NaN
2        0.111575  0.573355  0.605075  0.016770  0.163355    NaN
3        0.482222  0.582363  0.648757  0.588044  0.436126    NaN
4        0.972434  0.555393  0.074069  0.479434  0.083058    NaN
..            ...       ...       ...       ...       ...    ...
329     0.0834631  0.722638  0.083766  0.475829  0.042728    NaN
330      0.746198  0.605953  0.415325  0.034253  0.236854    NaN
331      0.840454  0.892945  0.110913  0.604027  0.659915    NaN
332      0.262958  0.041827  0.723585  0.043194  0.388546    NaN
333      0.211435  0.178870  0.535477  0.601307  0.023921    NaN

[334 rows x 6 columns]

In [91]:
# code to drop a column
new_df.drop(0, axis=1)

                A         B         c         D         E
0    Ashish Kumar  0.090743  0.849483  0.732505  0.716665
1         0.97864  0.326711  0.708008  0.492678  0.090354
2        0.111575  0.573355  0.605075  0.016770  0.163355
3        0.482222  0.582363  0.648757  0.588044  0.436126
4        0.972434  0.555393  0.074069  0.479434  0.083058
..            ...       ...       ...       ...       ...
329     0.0834631  0.722638  0.083766  0.475829  0.042728
330      0.746198  0.605953  0.415325  0.034253  0.236854
331      0.840454  0.892945  0.110913  0.604027  0.659915
332      0.262958  0.041827  0.723585  0.043194  0.388546
333      0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [92]:
new_df.loc[0,0] = 768

In [93]:
new_df.head()

              A         B         c         D         E      0
0  Ashish Kumar  0.090743  0.849483  0.732505  0.716665  768.0
1       0.97864  0.326711  0.708008  0.492678  0.090354    NaN
2      0.111575  0.573355  0.605075  0.016770  0.163355    NaN
3      0.482222  0.582363  0.648757  0.588044  0.436126    NaN
4      0.972434  0.555393  0.074069  0.479434  0.083058    NaN

In [94]:
#It just drop the value of zero column df.
new_df.drop(0)

             A         B         c         D         E   0
1      0.97864  0.326711  0.708008  0.492678  0.090354 NaN
2     0.111575  0.573355  0.605075  0.016770  0.163355 NaN
3     0.482222  0.582363  0.648757  0.588044  0.436126 NaN
4     0.972434  0.555393  0.074069  0.479434  0.083058 NaN
5     0.399059  0.965824  0.947327  0.275640  0.560488 NaN
..         ...       ...       ...       ...       ...  ..
329  0.0834631  0.722638  0.083766  0.475829  0.042728 NaN
330   0.746198  0.605953  0.415325  0.034253  0.236854 NaN
331   0.840454  0.892945  0.110913  0.604027  0.659915 NaN
332   0.262958  0.041827  0.723585  0.043194  0.388546 NaN
333   0.211435  0.178870  0.535477  0.601307  0.023921 NaN

[333 rows x 6 columns]

In [95]:
new_df.drop(0, axis=1)

                A         B         c         D         E
0    Ashish Kumar  0.090743  0.849483  0.732505  0.716665
1         0.97864  0.326711  0.708008  0.492678  0.090354
2        0.111575  0.573355  0.605075  0.016770  0.163355
3        0.482222  0.582363  0.648757  0.588044  0.436126
4        0.972434  0.555393  0.074069  0.479434  0.083058
..            ...       ...       ...       ...       ...
329     0.0834631  0.722638  0.083766  0.475829  0.042728
330      0.746198  0.605953  0.415325  0.034253  0.236854
331      0.840454  0.892945  0.110913  0.604027  0.659915
332      0.262958  0.041827  0.723585  0.043194  0.388546
333      0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [96]:
new_df.head()

              A         B         c         D         E      0
0  Ashish Kumar  0.090743  0.849483  0.732505  0.716665  768.0
1       0.97864  0.326711  0.708008  0.492678  0.090354    NaN
2      0.111575  0.573355  0.605075  0.016770  0.163355    NaN
3      0.482222  0.582363  0.648757  0.588044  0.436126    NaN
4      0.972434  0.555393  0.074069  0.479434  0.083058    NaN

In [97]:
new_df = new_df.drop(0, axis=1)

In [98]:
new_df.head()

              A         B         c         D         E
0  Ashish Kumar  0.090743  0.849483  0.732505  0.716665
1       0.97864  0.326711  0.708008  0.492678  0.090354
2      0.111575  0.573355  0.605075  0.016770  0.163355
3      0.482222  0.582363  0.648757  0.588044  0.436126
4      0.972434  0.555393  0.074069  0.479434  0.083058

In [99]:
#code to get some specific column and row.
new_df.loc[1,'A']

0.9786398598711357

In [100]:
new_df.loc[[1,2],'c']

1    0.708008
2    0.605075
Name: c, dtype: float64

In [101]:
new_df.loc[[1, 2], ['c', 'D']]

          c         D
1  0.708008  0.492678
2  0.605075  0.016770

In [102]:
# code to get all the rows.
new_df.loc[:,['c', 'D']]

            c         D
0    0.849483  0.732505
1    0.708008  0.492678
2    0.605075  0.016770
3    0.648757  0.588044
4    0.074069  0.479434
..        ...       ...
329  0.083766  0.475829
330  0.415325  0.034253
331  0.110913  0.604027
332  0.723585  0.043194
333  0.535477  0.601307

[334 rows x 2 columns]

In [103]:
# code to get all the columns
new_df.loc[[1,2],:]

          A         B         c         D         E
1   0.97864  0.326711  0.708008  0.492678  0.090354
2  0.111575  0.573355  0.605075  0.016770  0.163355

In [104]:
new_df.loc[0,0] = 0.23

In [105]:
new_df = new_df.drop(0, axis=1)

In [106]:
new_df

                A         B         c         D         E
0    Ashish Kumar  0.090743  0.849483  0.732505  0.716665
1         0.97864  0.326711  0.708008  0.492678  0.090354
2        0.111575  0.573355  0.605075  0.016770  0.163355
3        0.482222  0.582363  0.648757  0.588044  0.436126
4        0.972434  0.555393  0.074069  0.479434  0.083058
..            ...       ...       ...       ...       ...
329     0.0834631  0.722638  0.083766  0.475829  0.042728
330      0.746198  0.605953  0.415325  0.034253  0.236854
331      0.840454  0.892945  0.110913  0.604027  0.659915
332      0.262958  0.041827  0.723585  0.043194  0.388546
333      0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [107]:
new_df.loc[0, 'A'] = 0.34

In [108]:
new_df = new_df.drop(0, axis=1)

KeyError: '[0] not found in axis'

In [109]:
new_df

             A         B         c         D         E
0         0.34  0.090743  0.849483  0.732505  0.716665
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[334 rows x 5 columns]

In [110]:
# code to get all the rows which column A value is less than 0.3
new_df.loc[(new_df['A']<0.3)]

              A         B         c         D         E
2      0.111575  0.573355  0.605075  0.016770  0.163355
6    0.00160018  0.343217  0.893049  0.090097  0.686310
7      0.129345  0.687957  0.045786  0.207276  0.081083
9     0.0378539  0.360142  0.995574  0.077849  0.856702
12     0.295473  0.267616  0.202430  0.115927  0.436905
..          ...       ...       ...       ...       ...
326    0.294448  0.307124  0.769825  0.424119  0.355792
328   0.0888768  0.727150  0.193268  0.720714  0.612661
329   0.0834631  0.722638  0.083766  0.475829  0.042728
332    0.262958  0.041827  0.723585  0.043194  0.388546
333    0.211435  0.178870  0.535477  0.601307  0.023921

[93 rows x 5 columns]

In [111]:
# code to get all the rows where column A value is less than 0.3 and C is greater than 0.1
new_df.loc[(new_df['A']<0.3) & (new_df['c']>0.1)]

              A         B         c         D         E
2      0.111575  0.573355  0.605075  0.016770  0.163355
6    0.00160018  0.343217  0.893049  0.090097  0.686310
9     0.0378539  0.360142  0.995574  0.077849  0.856702
12     0.295473  0.267616  0.202430  0.115927  0.436905
13    0.0392269  0.494094  0.467511  0.247587  0.281809
..          ...       ...       ...       ...       ...
318    0.134281  0.622610  0.180064  0.302873  0.653659
326    0.294448  0.307124  0.769825  0.424119  0.355792
328   0.0888768  0.727150  0.193268  0.720714  0.612661
332    0.262958  0.041827  0.723585  0.043194  0.388546
333    0.211435  0.178870  0.535477  0.601307  0.023921

[86 rows x 5 columns]

In [112]:
new_df.head(2)

         A         B         c         D         E
0     0.34  0.090743  0.849483  0.732505  0.716665
1  0.97864  0.326711  0.708008  0.492678  0.090354

In [113]:
new_df.iloc[0, 4]

0.7166654864961112

In [114]:
new_df.iloc[[0,1], [1,2]]

          B         c
0  0.090743  0.849483
1  0.326711  0.708008

In [115]:
new_df.drop(0)

             A         B         c         D         E
1      0.97864  0.326711  0.708008  0.492678  0.090354
2     0.111575  0.573355  0.605075  0.016770  0.163355
3     0.482222  0.582363  0.648757  0.588044  0.436126
4     0.972434  0.555393  0.074069  0.479434  0.083058
5     0.399059  0.965824  0.947327  0.275640  0.560488
..         ...       ...       ...       ...       ...
329  0.0834631  0.722638  0.083766  0.475829  0.042728
330   0.746198  0.605953  0.415325  0.034253  0.236854
331   0.840454  0.892945  0.110913  0.604027  0.659915
332   0.262958  0.041827  0.723585  0.043194  0.388546
333   0.211435  0.178870  0.535477  0.601307  0.023921

[333 rows x 5 columns]

In [116]:
new_df.drop(['A', 'c'], axis=1)

            B         D         E
0    0.090743  0.732505  0.716665
1    0.326711  0.492678  0.090354
2    0.573355  0.016770  0.163355
3    0.582363  0.588044  0.436126
4    0.555393  0.479434  0.083058
..        ...       ...       ...
329  0.722638  0.475829  0.042728
330  0.605953  0.034253  0.236854
331  0.892945  0.604027  0.659915
332  0.041827  0.043194  0.388546
333  0.178870  0.601307  0.023921

[334 rows x 3 columns]

In [117]:
# code to change the new_df means it will modify the original only.
new_df.drop(['A', 'c'], axis=1, inplace=True)

In [118]:
new_df

            B         D         E
0    0.090743  0.732505  0.716665
1    0.326711  0.492678  0.090354
2    0.573355  0.016770  0.163355
3    0.582363  0.588044  0.436126
4    0.555393  0.479434  0.083058
..        ...       ...       ...
329  0.722638  0.475829  0.042728
330  0.605953  0.034253  0.236854
331  0.892945  0.604027  0.659915
332  0.041827  0.043194  0.388546
333  0.178870  0.601307  0.023921

[334 rows x 3 columns]

In [119]:
new_df.drop([1,5], axis=0, inplace=True)

In [120]:
new_df

            B         D         E
0    0.090743  0.732505  0.716665
2    0.573355  0.016770  0.163355
3    0.582363  0.588044  0.436126
4    0.555393  0.479434  0.083058
6    0.343217  0.090097  0.686310
..        ...       ...       ...
329  0.722638  0.475829  0.042728
330  0.605953  0.034253  0.236854
331  0.892945  0.604027  0.659915
332  0.041827  0.043194  0.388546
333  0.178870  0.601307  0.023921

[332 rows x 3 columns]

In [121]:
# code to reset the index of a dataframe. but it will add one column.
new_df.reset_index()

     index         B         D         E
0        0  0.090743  0.732505  0.716665
1        2  0.573355  0.016770  0.163355
2        3  0.582363  0.588044  0.436126
3        4  0.555393  0.479434  0.083058
4        6  0.343217  0.090097  0.686310
..     ...       ...       ...       ...
327    329  0.722638  0.475829  0.042728
328    330  0.605953  0.034253  0.236854
329    331  0.892945  0.604027  0.659915
330    332  0.041827  0.043194  0.388546
331    333  0.178870  0.601307  0.023921

[332 rows x 4 columns]

In [122]:
# code to reset the index of a dataframe without adding any column.
new_df.reset_index(drop=True)

            B         D         E
0    0.090743  0.732505  0.716665
1    0.573355  0.016770  0.163355
2    0.582363  0.588044  0.436126
3    0.555393  0.479434  0.083058
4    0.343217  0.090097  0.686310
..        ...       ...       ...
327  0.722638  0.475829  0.042728
328  0.605953  0.034253  0.236854
329  0.892945  0.604027  0.659915
330  0.041827  0.043194  0.388546
331  0.178870  0.601307  0.023921

[332 rows x 3 columns]

In [123]:
new_df.reset_index(drop=True, inplace=True)

In [124]:
new_df

            B         D         E
0    0.090743  0.732505  0.716665
1    0.573355  0.016770  0.163355
2    0.582363  0.588044  0.436126
3    0.555393  0.479434  0.083058
4    0.343217  0.090097  0.686310
..        ...       ...       ...
327  0.722638  0.475829  0.042728
328  0.605953  0.034253  0.236854
329  0.892945  0.604027  0.659915
330  0.041827  0.043194  0.388546
331  0.178870  0.601307  0.023921

[332 rows x 3 columns]

In [125]:
new_df['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [126]:
new_df['B'] = None

In [127]:
new_df

        B         D         E
0    None  0.732505  0.716665
1    None  0.016770  0.163355
2    None  0.588044  0.436126
3    None  0.479434  0.083058
4    None  0.090097  0.686310
..    ...       ...       ...
327  None  0.475829  0.042728
328  None  0.034253  0.236854
329  None  0.604027  0.659915
330  None  0.043194  0.388546
331  None  0.601307  0.023921

[332 rows x 3 columns]

In [128]:
new_df['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [129]:
new_df.loc[:,'B'] = None

In [130]:
new_df['B'].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
327    True
328    True
329    True
330    True
331    True
Name: B, Length: 332, dtype: bool

In [131]:
new_df.loc[:,'B']=34

In [132]:
new_df

      B         D         E
0    34  0.732505  0.716665
1    34  0.016770  0.163355
2    34  0.588044  0.436126
3    34  0.479434  0.083058
4    34  0.090097  0.686310
..   ..       ...       ...
327  34  0.475829  0.042728
328  34  0.034253  0.236854
329  34  0.604027  0.659915
330  34  0.043194  0.388546
331  34  0.601307  0.023921

[332 rows x 3 columns]

In [133]:
df = pd.DataFrame({"name":['Ashish', 'Kumar', 'Sah'],
                  "toy":[np.nan, 'BatMobile', 'BullWhip'],
                  "born":[pd.NaT, pd.Timestamp('1940-04-25'),pd.NaT]})

In [134]:
df

     name        toy       born
0  Ashish        NaN        NaT
1   Kumar  BatMobile 1940-04-25
2     Sah   BullWhip        NaT

In [135]:
df.dropna()

    name        toy       born
1  Kumar  BatMobile 1940-04-25

In [136]:
# code to remove the Na when all the element of a column are Na
df.dropna(how='all')

     name        toy       born
0  Ashish        NaN        NaT
1   Kumar  BatMobile 1940-04-25
2     Sah   BullWhip        NaT

In [137]:
df1 = pd.DataFrame({"name":['Ashish', 'Kumar', 'Sah'],
                  "toy":[np.nan, np.nan, np.nan],
                  "born":[pd.NaT, pd.Timestamp('1940-04-25'),pd.NaT]})

In [138]:
df1

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25
2     Sah  NaN        NaT

In [139]:
df1.dropna(how='all', axis=1)

     name       born
0  Ashish        NaT
1   Kumar 1940-04-25
2     Sah        NaT

In [140]:
df12 = pd.DataFrame({"name":['Ashish', 'Kumar', 'Ashish'],
                  "toy":[np.nan, np.nan, np.nan],
                  "born":[pd.NaT, pd.Timestamp('1940-04-25'),pd.NaT]})

In [141]:
df12

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25
2  Ashish  NaN        NaT

In [142]:
# By default keep = first
df12.drop_duplicates(subset=['name'])

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25

In [146]:
# it will keep first value and drop another
df12.drop_duplicates(subset=['name'], keep='first')

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25

In [148]:
# It will keep last value and drop another
df12.drop_duplicates(subset=['name'], keep='last')

     name  toy       born
1   Kumar  NaN 1940-04-25
2  Ashish  NaN        NaT

In [149]:
# It will drop all
df12.drop_duplicates(subset=['name'], keep=False)

    name  toy       born
1  Kumar  NaN 1940-04-25

In [152]:
# It will return shape of that dataframe.
df12.shape

(3, 3)

In [153]:
# It will return information about the dataframe
df12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     0 non-null      float64
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 200.0+ bytes

In [155]:
# Code to count unique value of a column.
df12['name'].value_counts(dropna=False)

Ashish    2
Kumar     1
Name: name, dtype: int64

In [156]:
df12['toy'].value_counts(dropna=True)

Series([], Name: toy, dtype: int64)

In [157]:
df12

     name  toy       born
0  Ashish  NaN        NaT
1   Kumar  NaN 1940-04-25
2  Ashish  NaN        NaT

In [158]:
df12['born'].value_counts(dropna=True)

1940-04-25    1
Name: born, dtype: int64

In [159]:
df12['born'].value_counts(dropna=False)

NaT           2
1940-04-25    1
Name: born, dtype: int64

In [161]:
df12.isnull()

    name   toy   born
0  False  True   True
1  False  True  False
2  False  True   True

In [162]:
df12.notnull()

   name    toy   born
0  True  False  False
1  True  False   True
2  True  False  False

In [168]:
# quiz -> create a dataframe which contains only integers with 3 rows and 2 columns.
# run following dataframe methods on them.

a_dict = {'roll_name': [1, 2, 3], 'result': [88, 89, 90]}
df = pd.DataFrame(a_dict)

In [169]:
df

   roll_name  result
0          1      88
1          2      89
2          3      90

In [170]:
df.describe()

       roll_name  result
count        3.0     3.0
mean         2.0    89.0
std          1.0     1.0
min          1.0    88.0
25%          1.5    88.5
50%          2.0    89.0
75%          2.5    89.5
max          3.0    90.0

In [171]:
df.mean()

roll_name     2.0
result       89.0
dtype: float64

In [172]:
df.corr()

           roll_name  result
roll_name        1.0     1.0
result           1.0     1.0

In [173]:
df.count()

roll_name    3
result       3
dtype: int64

In [174]:
df.max()

roll_name     3
result       90
dtype: int64

In [175]:
df.min()

roll_name     1
result       88
dtype: int64

In [176]:
df.median()

roll_name     2.0
result       89.0
dtype: float64

In [177]:
df.std()

roll_name    1.0
result       1.0
dtype: float64

In [178]:
# code to read data from excel
# first we need to install xlrd
# pip install xlrd

#data = pd.to_excel('data.xlsx')
# data1 = pd.to_excel('data.xlsx', sheet_name='sheet2')

In [179]:
# code to write in excel sheet.
# first we need to install openpyxl
# pip install openpyxl

# data.to_excel('data.xlsx', sheet_name='sheet2')